// Створіть функцію, яка використовує проміс для імітації затримки у 2 секунди перед поверненням значення.
// Вимоги:

// • Створіть функцію waitForTwoSeconds(), яка повертає проміс, що вирішується через 2 секунди.
// • Після виконання проміса функція повинна вивести в консоль повідомлення “2 секунди пройшло!”.

// * треба буде погугліть (або подитись кінець лекції)
// * використовуйте setTimeout()

function waitForTwoSeconds(): Promise<void> {
  return new Promise((resolve) => {
    setTimeout(() => {
      console.log("2 секунди пройшло!");
      resolve();
    }, 2000);
  });
}
